n=3
k=7#การคำนวณทางคณิตศาสตร์

v=k+n#การคำนวณทางคณิตศาสตร์
print(v)

d1=n**k
print(d1)#การคำนวณทางคณิตศาสตร์

o=2
o +=5 #การคำนวณทางคณิตศาสตร์

p1=k < n 
print(p1) #การเปรียบเทียบค่าของตัวแปร k และ n โดยใช้เครื่องหมาย < ซึ่งจะให้ผลลัพธ์เป็น True หรือ False

p=True #การคำนวณทางตรรกศาสตร์
q=False #การคำนวณทางตรรกศาสตร์

w1= p or q #การคำนวณทางตรรกศาสตร์ โดยใช้เครื่องหมาย or ซึ่งจะให้ผลลัพธ์เป็น True ถ้าตัวแปร p หรือ q เป็น True อย่างน้อยหนึ่งตัว และจะให้ผลลัพธ์เป็น False ก็ต่อเมื่อทั้ง p และ q เป็น False เท่านั้น
w2= p and q #การคำนวณทางตรรกศาสตร์ โดยใช้เครื่องหมาย and ซึ่งจะให้ผลลัพธ์เป็น True ก็ต่อเมื่อทั้ง p และ q เป็น True เท่านั้น และจะให้ผลลัพธ์เป็น False ถ้าตัวแปร p หรือ q เป็น False อย่างน้อยหนึ่งตัว
w3= not q #การคำนวณทางตรรกศาสตร์ โดยใช้เครื่องหมาย not ซึ่งจะให้ผลลัพธ์เป็น True ถ้าตัวแปร q เป็น False และจะให้ผลลัพธ์เป็น False ถ้าตัวแปร q เป็น True
print(w1,w2,w3) #การแสดงผลลัพธ์ของการคำนวณทางตรรกศาสตร์ โดยใช้ฟังก์ชัน print เพื่อแสดงค่าของตัวแปร w1, w2 และ w3 ซึ่งเป็นผลลัพธ์ของการคำนวณทางตรรกศาสตร์ที่ได้จากตัวแปร p และ q

score=79 #คะแนนสอบ

if score >= 80: #การใช้คำสั่ง if เพื่อเช็คเงื่อนไขว่าคะแนนสอบ (score) มีค่ามากกว่าหรือเท่ากับ 80 หรือไม่
 print('GradeA') #ถ้าคะแนนสอบมีค่ามากกว่าหรือเท่ากับ 80 จะทำการแสดงข้อความ 'GradeA' ออกมา
 print('inw') #การใช้คำสั่ง print เพื่อแสดงข้อความ 'inw' ออกมา
elif score >= 70:
 print('GradeB')
else:
 print('GradeD+')

for i in range(1, 6): #การใช้คำสั่ง for เพื่อทำการวนลูปตั้งแต่ 1 ถึง 5 โดยใช้ฟังก์ชัน range(1, 6) ซึ่งจะสร้างลำดับตัวเลขตั้งแต่ 1 ถึง 5 (ไม่รวม 6)
 if i % 3 == 0: 
   continue
 double = i * 3
 print(i)#การใช้คำสั่ง if เพื่อตรวจสอบว่า i หารด้วย 3 ลงตัวหรือไม่ (i % 3 == 0) ถ้าหาก i หารด้วย 3 ลงตัว จะใช้คำสั่ง continue เพื่อข้ามการทำงานในรอบนั้นและไปยังรอบถัดไปของลูป แต่ถ้า i ไม่หารด้วย 3 ลงตัว จะทำการคำนวณ double โดยการคูณ i ด้วย 3 และแสดงค่า i ออกมา

def get_box_area(width, length, height): 
 if width < 0 or length < 0 or height < 0:
  return 0
 box_area = width * length * height
 return box_area 

box1 = get_box_area (4,-5,4)

print(box1)

score = int(input("กรุณษป้อนคะแนนสอบของคุณ:"))
print("คะแนนสอบของคุณ =", score)

if score >= 50:
 print("สอบผ่าน")
else:
 print("สอบไม่ผ่าน")

usedsername = input("กรุณาป้อนชื่อผู้ใช้ของคุณ:")
password = input("กรุณาป้อนรหัสผ่านของคุณ:")

if not usedsername == "admin":
 print("เข้าสู่ระบบสำเร็จ")
else:
  print("เข้าสู่ระบบไม่สำเร็จ")